<h1>Inhaltsverzeichnis<span class="tocSkip"></span></h1>
<div class="toc"><ul class="toc-item"><li><span><a href="#Die-Series-Datenstruktur" data-toc-modified-id="Die-Series-Datenstruktur-1"><span class="toc-item-num">1&nbsp;&nbsp;</span>Die Series-Datenstruktur</a></span><ul class="toc-item"><li><span><a href="#Erzeugen-einer-Series-(über-eine-Liste)" data-toc-modified-id="Erzeugen-einer-Series-(über-eine-Liste)-1.1"><span class="toc-item-num">1.1&nbsp;&nbsp;</span>Erzeugen einer Series (über eine Liste)</a></span></li><li><span><a href="#Jede-Series-hat-einen-Index" data-toc-modified-id="Jede-Series-hat-einen-Index-1.2"><span class="toc-item-num">1.2&nbsp;&nbsp;</span>Jede Series hat einen Index</a></span></li><li><span><a href="#Dem-Index-einen-Namen-geben" data-toc-modified-id="Dem-Index-einen-Namen-geben-1.3"><span class="toc-item-num">1.3&nbsp;&nbsp;</span>Dem Index einen Namen geben</a></span></li><li><span><a href="#Zugriff-auf-einzelne-Werte-einer-Series" data-toc-modified-id="Zugriff-auf-einzelne-Werte-einer-Series-1.4"><span class="toc-item-num">1.4&nbsp;&nbsp;</span>Zugriff auf einzelne Werte einer Series</a></span></li><li><span><a href="#Hinzufügen-von-Werten-zu-einer-Series" data-toc-modified-id="Hinzufügen-von-Werten-zu-einer-Series-1.5"><span class="toc-item-num">1.5&nbsp;&nbsp;</span>Hinzufügen von Werten zu einer Series</a></span></li><li><span><a href="#Quiz-Time!" data-toc-modified-id="Quiz-Time!-1.6"><span class="toc-item-num">1.6&nbsp;&nbsp;</span>Quiz-Time!</a></span></li><li><span><a href="#Entfernen-von-Werten-(durch-Angabe-von-Indizes)" data-toc-modified-id="Entfernen-von-Werten-(durch-Angabe-von-Indizes)-1.7"><span class="toc-item-num">1.7&nbsp;&nbsp;</span>Entfernen von Werten (durch Angabe von Indizes)</a></span></li><li><span><a href="#Erzeugen-einer-Series-über-ein-Dictionary:" data-toc-modified-id="Erzeugen-einer-Series-über-ein-Dictionary:-1.8"><span class="toc-item-num">1.8&nbsp;&nbsp;</span>Erzeugen einer Series über ein Dictionary:</a></span></li></ul></li><li><span><a href="#Die-DataFrame-Datenstruktur" data-toc-modified-id="Die-DataFrame-Datenstruktur-2"><span class="toc-item-num">2&nbsp;&nbsp;</span>Die DataFrame-Datenstruktur</a></span><ul class="toc-item"><li><span><a href="#Erzeugen-eines-DataFrames-(aus-Series)" data-toc-modified-id="Erzeugen-eines-DataFrames-(aus-Series)-2.1"><span class="toc-item-num">2.1&nbsp;&nbsp;</span>Erzeugen eines DataFrames (aus Series)</a></span></li><li><span><a href="#Andere-Spaltenreihenfolge" data-toc-modified-id="Andere-Spaltenreihenfolge-2.2"><span class="toc-item-num">2.2&nbsp;&nbsp;</span>Andere Spaltenreihenfolge</a></span></li><li><span><a href="#Identifizierung-fehlender-Werte-(NaN-Einträge)" data-toc-modified-id="Identifizierung-fehlender-Werte-(NaN-Einträge)-2.3"><span class="toc-item-num">2.3&nbsp;&nbsp;</span>Identifizierung fehlender Werte (NaN Einträge)</a></span></li><li><span><a href="#Erzeugen-eines-DataFrames-(über-Dictionary-von-Listen)" data-toc-modified-id="Erzeugen-eines-DataFrames-(über-Dictionary-von-Listen)-2.4"><span class="toc-item-num">2.4&nbsp;&nbsp;</span>Erzeugen eines DataFrames (über Dictionary von Listen)</a></span></li><li><span><a href="#Zugriff-auf-Spalten-und-Zeilen" data-toc-modified-id="Zugriff-auf-Spalten-und-Zeilen-2.5"><span class="toc-item-num">2.5&nbsp;&nbsp;</span>Zugriff auf Spalten und Zeilen</a></span></li><li><span><a href="#Löschen-von-Spalten-und-Zeilen" data-toc-modified-id="Löschen-von-Spalten-und-Zeilen-2.6"><span class="toc-item-num">2.6&nbsp;&nbsp;</span>Löschen von Spalten und Zeilen</a></span></li><li><span><a href="#Hinzufügen-von-Spalten" data-toc-modified-id="Hinzufügen-von-Spalten-2.7"><span class="toc-item-num">2.7&nbsp;&nbsp;</span>Hinzufügen von Spalten</a></span></li><li><span><a href="#Zwei-Variablen,-die-ein-DataFrame-referenzieren" data-toc-modified-id="Zwei-Variablen,-die-ein-DataFrame-referenzieren-2.8"><span class="toc-item-num">2.8&nbsp;&nbsp;</span>Zwei Variablen, die ein DataFrame referenzieren</a></span></li><li><span><a href="#Hinzufügen-von-Zeilen" data-toc-modified-id="Hinzufügen-von-Zeilen-2.9"><span class="toc-item-num">2.9&nbsp;&nbsp;</span>Hinzufügen von Zeilen</a></span></li></ul></li></ul></div>

# Die Series-Datenstruktur

Die Series ist die wichtigste Datenstruktur in Pandas. Es handelt sich um ein eindimensionales Array-artiges Objekt, das

- eine Sequenz von Werten speichert
und
- mit einem Index-Objekt verbunden ist, das den Werten "Labels" (Namen) zuordnet

Eine Series kann man sich wie eine Spalte einer Tabelle vorstellen.

## Erzeugen einer Series (über eine Liste)

In [1]:
import pandas as pd

# Erstellen einer Series über eine Python-Liste
s1 = pd.Series( ["München", "Stuttgart", "Saarbrücken", "Mainz", "Wiesbaden"] )

In [2]:
s1

0        München
1      Stuttgart
2    Saarbrücken
3          Mainz
4      Wiesbaden
dtype: object

## Jede Series hat einen Index

Wir haben hier keinen expliziten Index (Zeilenbezeichnung) angegeben, daher hat Pandas die Zeilen einfach durchnummiert.

Wir können auf die eigentliche Werte und den Index separat zugreifen.

Zugriff auf die Werte:

In [13]:
print(s1.values)

['München' 'Stuttgart' 'Saarbrücken' 'Mainz' 'Wiesbaden']

In [14]:
print(type(s1.values))

<class 'numpy.ndarray'>

Wir sehen also: die Werte werden innerhalb einer Series als NumPy Array gespeichert.

Jetzt greifen wir auf den Index zu:

In [15]:
print(s1.index)

RangeIndex(start=0, stop=5, step=1, name='Bundesland')

In [16]:
print(type(s1.index))

<class 'pandas.core.indexes.range.RangeIndex'>

## Dem Index einen Namen geben

Bisher hat der Index keinen Namen. Wir können diesem aber auch einen Namen geben:

In [17]:
s1.index.name = "Bundesland"

In [18]:
s1

Bundesland
0        München
1      Stuttgart
2    Saarbrücken
3          Mainz
4      Wiesbaden
dtype: object

Jetzt wollen wir den Index sinnvoller definieren:

In [19]:
s1.index = ["Bayern", "Baden-Württemberg", "Saarland", "Rheinland-Pfalz", "Hessen"]

In [20]:
s1

Bayern                   München
Baden-Württemberg      Stuttgart
Saarland             Saarbrücken
Rheinland-Pfalz            Mainz
Hessen                 Wiesbaden
dtype: object

Es fällt auf: wir haben den Index neu definiert. Dabei ist der Name verloren gegangen! Definieren wir einfach wieder neu:

In [21]:
s1.index.name = "Bundesland"

In [22]:
s1

Bundesland
Bayern                   München
Baden-Württemberg      Stuttgart
Saarland             Saarbrücken
Rheinland-Pfalz            Mainz
Hessen                 Wiesbaden
dtype: object

In [23]:
print(type(s1.index))

<class 'pandas.core.indexes.base.Index'>

## Zugriff auf einzelne Werte einer Series

Lesende Zugriffsbeispiele (auf Werte):

In [24]:
s1["Hessen"]

'Wiesbaden'

In [25]:
print( type(s1["Hessen"]) )

<class 'str'>

In [26]:
s2 = s1[ ["Hessen", "Bayern", "Saarland"] ]
print(s2)

Bundesland
Hessen        Wiesbaden
Bayern          München
Saarland    Saarbrücken
dtype: object

In [27]:
print(type(s2))

<class 'pandas.core.series.Series'>

In [28]:
s1[-1]

'Wiesbaden'

In [29]:
s1[0]

'München'

Lesende Zugriffsbeispiele (auf Indizes):

In [30]:
s1.index[0]

'Bayern'

In [31]:
s1.index[0:2]

Index(['Bayern', 'Baden-Württemberg'], dtype='object', name='Bundesland')

Schreibende Zugriffsbeispiele (auf Werte):

In [42]:
s1["Bayern"] = "keine Ahnung!"

In [43]:
s1

Bundesland
Bayern               keine Ahnung!
Baden-Württemberg        Stuttgart
Saarland               Saarbrücken
Rheinland-Pfalz              Mainz
Hessen                   Wiesbaden
NRW                     Düsseldorf
dtype: object

In [44]:
s1["Bayern"] = -123

In [45]:
s1

Bundesland
Bayern                      -123
Baden-Württemberg      Stuttgart
Saarland             Saarbrücken
Rheinland-Pfalz            Mainz
Hessen                 Wiesbaden
NRW                   Düsseldorf
dtype: object

Beachte: Die Einträge einer Series können also auch einen unterschiedlichen Datentyp haben!

In [46]:
print(type(s1[0]))

<class 'int'>

In [47]:
print(type(s1[1]))

<class 'str'>

## Hinzufügen von Werten zu einer Series

Zu einer Series können einzelne Werte oder auch in Form einer Liste hinzugefügt werden.

Hinzufügen eines einzelnen Wertes:

In [48]:
s1["NRW"] = "Düsseldorf"

In [49]:
s1

Bundesland
Bayern                      -123
Baden-Württemberg      Stuttgart
Saarland             Saarbrücken
Rheinland-Pfalz            Mainz
Hessen                 Wiesbaden
NRW                   Düsseldorf
dtype: object

Hinzufügen mehrerer Werte:

In [50]:
s2 = pd.Series( ["Hannover", "Dresden"],
                index=["Niedersachsen", "Sachsen"] )

In [51]:
s2

Niedersachsen    Hannover
Sachsen           Dresden
dtype: object

In [52]:
s1.append( s2 )

Bayern                      -123
Baden-Württemberg      Stuttgart
Saarland             Saarbrücken
Rheinland-Pfalz            Mainz
Hessen                 Wiesbaden
NRW                   Düsseldorf
Niedersachsen           Hannover
Sachsen                  Dresden
dtype: object

In [53]:
s1

Bundesland
Bayern                      -123
Baden-Württemberg      Stuttgart
Saarland             Saarbrücken
Rheinland-Pfalz            Mainz
Hessen                 Wiesbaden
NRW                   Düsseldorf
dtype: object

s1 hat sich gar nicht geändert! D.h. `append()` liefert nur eine neue Series zurück und verändert s1 gar nicht:

In [54]:
s1 = s1.append( s2 )

In [55]:
s1

Bayern                      -123
Baden-Württemberg      Stuttgart
Saarland             Saarbrücken
Rheinland-Pfalz            Mainz
Hessen                 Wiesbaden
NRW                   Düsseldorf
Niedersachsen           Hannover
Sachsen                  Dresden
dtype: object

## Quiz-Time!

Wie kann man herausfinden, aus wievielen Werten eine Series besteht?

In [56]:
print("s1 besteht aus", len(s1.values), "Werten" )

s1 besteht aus 8 Werten

In [57]:
print("s1 besteht aus", s1.size, "Werten" )

s1 besteht aus 8 Werten

## Entfernen von Werten (durch Angabe von Indizes)

In [58]:
s1

Bayern                      -123
Baden-Württemberg      Stuttgart
Saarland             Saarbrücken
Rheinland-Pfalz            Mainz
Hessen                 Wiesbaden
NRW                   Düsseldorf
Niedersachsen           Hannover
Sachsen                  Dresden
dtype: object

In [59]:
s1.drop( "Baden-Württemberg" )

Bayern                    -123
Saarland           Saarbrücken
Rheinland-Pfalz          Mainz
Hessen               Wiesbaden
NRW                 Düsseldorf
Niedersachsen         Hannover
Sachsen                Dresden
dtype: object

In [60]:
s1

Bayern                      -123
Baden-Württemberg      Stuttgart
Saarland             Saarbrücken
Rheinland-Pfalz            Mainz
Hessen                 Wiesbaden
NRW                   Düsseldorf
Niedersachsen           Hannover
Sachsen                  Dresden
dtype: object

s1 hat sich doch gar nicht verändert! D.h. `drop()` liefert nur eine neue Series zurück und verändert s1 gar nicht.

In [61]:
s1 = s1.drop( "Baden-Württemberg" )

In [62]:
s1

Bayern                    -123
Saarland           Saarbrücken
Rheinland-Pfalz          Mainz
Hessen               Wiesbaden
NRW                 Düsseldorf
Niedersachsen         Hannover
Sachsen                Dresden
dtype: object

Entfernen mehrerer Einträge:

In [63]:
s1 = s1.drop( ["Hessen", "NRW"] )

In [64]:
s1

Bayern                    -123
Saarland           Saarbrücken
Rheinland-Pfalz          Mainz
Niedersachsen         Hannover
Sachsen                Dresden
dtype: object

Entfernen des 2. und 3. Wertes:

In [65]:
s1.drop(s1.index[1:2])

Bayern                 -123
Rheinland-Pfalz       Mainz
Niedersachsen      Hannover
Sachsen             Dresden
dtype: object

## Erzeugen einer Series über ein Dictionary:

In [66]:
dic = { "Bayern": 13.0, "Rheinland-Pfalz": 4.0,\
      "Niedersachsen": 7.9, "Sachsen": 4.0}
s3 = pd.Series(dic)

In [67]:
s3

Bayern             13.0
Niedersachsen       7.9
Rheinland-Pfalz     4.0
Sachsen             4.0
dtype: float64

# Die DataFrame-Datenstruktur

Ein DataFrame ist eine Datentabelle, bei der jede Spalte aus einer Series besteht.

## Erzeugen eines DataFrames (aus Series)

Wir haben ja schon zwei Series:

In [68]:
s1

Bayern                    -123
Saarland           Saarbrücken
Rheinland-Pfalz          Mainz
Niedersachsen         Hannover
Sachsen                Dresden
dtype: object

In [69]:
s3

Bayern             13.0
Niedersachsen       7.9
Rheinland-Pfalz     4.0
Sachsen             4.0
dtype: float64

Wir benutzen jetzt beide Series, um ein erstes DataFrame zu erzeugen:

In [70]:
dic = {"Landeshauptstadt": s1, "Einwohner": s3}
d1 = pd.DataFrame( dic )

In [71]:
d1

                 Einwohner Landeshauptstadt
Bayern                13.0             -123
Niedersachsen          7.9         Hannover
Rheinland-Pfalz        4.0            Mainz
Saarland               NaN      Saarbrücken
Sachsen                4.0          Dresden

In [72]:
print(type(d1))

<class 'pandas.core.frame.DataFrame'>

Beachten Sie:
Die beiden Series haben nicht über den gleichen Index verfügt!

In [73]:
s1.index

Index(['Bayern', 'Saarland', 'Rheinland-Pfalz', 'Niedersachsen', 'Sachsen'], dtype='object')

In [74]:
s3.index

Index(['Bayern', 'Niedersachsen', 'Rheinland-Pfalz', 'Sachsen'], dtype='object')

Daher finden sich manchmal fehlende Einträge ("NaN") bei Einwohner oder bei Landeshauptstadt.

## Andere Spaltenreihenfolge

Beachten Sie, obwohl bei den Spalten zuerst "Landeshauptstadt" angegeben wurde, erscheint in der Tabelle `d1` zuerst als Spalte "Einwohner". Pandas sortiert also automatisch.

Was aber, wenn eine bestimmte Spaltenreihenfolge gewünscht ist?

In [91]:
d2 = d1[ ["Landeshauptstadt", "Einwohner" ] ]

In [92]:
d2

                Landeshauptstadt  Einwohner
Bayern                      -123       13.0
Niedersachsen           Hannover        7.9
Rheinland-Pfalz            Mainz        4.0
Saarland             Saarbrücken        NaN
Sachsen                  Dresden        4.0

## Identifizierung fehlender Werte (NaN Einträge)

In [77]:
d2.isnull()

                 Landeshauptstadt  Einwohner
Bayern                      False      False
Niedersachsen               False      False
Rheinland-Pfalz             False      False
Saarland                    False       True
Sachsen                     False      False

In [78]:
print( type(d2.isnull()) )

<class 'pandas.core.frame.DataFrame'>

Zählen, wieviele NaN Einträge es gibt:

In [79]:
d2.isnull().sum()

Landeshauptstadt    0
Einwohner           1
dtype: int64

Explizites Zählen der NaN Einträge für nur eine Series:

In [80]:
d2["Landeshauptstadt"].isnull()

Bayern             False
Niedersachsen      False
Rheinland-Pfalz    False
Saarland           False
Sachsen            False
Name: Landeshauptstadt, dtype: bool

In [81]:
d2["Landeshauptstadt"].isnull().sum()

0

Checke für jede Zeile, ob es mind. ein NaN Eintrag gibt:

In [82]:
d2.isnull().any(axis=1)

Bayern             False
Niedersachsen      False
Rheinland-Pfalz    False
Saarland            True
Sachsen            False
dtype: bool

Erzeuge einen neuen DataFrame, der nur Zeilen enthält, die einen fehlenden Eintrag haben:

In [83]:
d3 = d2[d2.isnull().any(axis=1)]

In [84]:
d3

         Landeshauptstadt  Einwohner
Saarland      Saarbrücken        NaN

Behandlung von NaN Einträgen Nr.1:
Filtere die Tabelle, so dass nur Zeilen übrig bleiben, die vollständig sind:

In [87]:
d2.dropna()

                Landeshauptstadt  Einwohner
Bayern                      -123       13.0
Niedersachsen           Hannover        7.9
Rheinland-Pfalz            Mainz        4.0
Sachsen                  Dresden        4.0

Behandlung von NaN Einträgen Nr.2:
Ersetze NaN Einträge durch konkreten Wert:

In [93]:
d2

                Landeshauptstadt  Einwohner
Bayern                      -123       13.0
Niedersachsen           Hannover        7.9
Rheinland-Pfalz            Mainz        4.0
Saarland             Saarbrücken        NaN
Sachsen                  Dresden        4.0

In [94]:
d2["Einwohner"].fillna(value="hab' keine Ahnung!")

Bayern                             13
Niedersachsen                     7.9
Rheinland-Pfalz                     4
Saarland           hab' keine Ahnung!
Sachsen                             4
Name: Einwohner, dtype: object

In [95]:
d2.fillna(value=-1.0)

                Landeshauptstadt  Einwohner
Bayern                      -123       13.0
Niedersachsen           Hannover        7.9
Rheinland-Pfalz            Mainz        4.0
Saarland             Saarbrücken       -1.0
Sachsen                  Dresden        4.0

## Erzeugen eines DataFrames (über Dictionary von Listen)

Wir haben oben das DataFrame über zwei Series erstellt.

Eine Series können wir uns als Dictionary von Indizes auf Werte vorstellen:

    {Index1: Wert1, Index2: Wert2, ...}

Ein DataFrame wiederum können wir uns als Liste von Series vorstellen:

    [Series1, Series2, ...]

Ein DataFrame kann dabei auch direkt über Angabe von Spaltennamen + Liste von Werten für die Spalte erstellt werden:

In [96]:
data = { "Landname": ["Deutschland", "USA", "Kanada"],
         "Einwohner": [80, 327, 37] }
d4 = pd.DataFrame( data )
d4

   Einwohner     Landname
0         80  Deutschland
1        327          USA
2         37       Kanada

Mit expliziter Angabe der Reihenfolge der Spalten:

In [97]:
data = { "Landname": ["Deutschland", "USA", "Kanada"],
         "Einwohner": [80, 327, 37] }
d5 = pd.DataFrame( data, columns=["Landname", "Einwohner"] )
d5

      Landname  Einwohner
0  Deutschland         80
1          USA        327
2       Kanada         37

## Zugriff auf Spalten und Zeilen

Den Zugriff auf eine Spalte eines DataFrames kennen wir ja schon:

In [98]:
d2

                Landeshauptstadt  Einwohner
Bayern                      -123       13.0
Niedersachsen           Hannover        7.9
Rheinland-Pfalz            Mainz        4.0
Saarland             Saarbrücken        NaN
Sachsen                  Dresden        4.0

In [99]:
d2["Einwohner"]

Bayern             13.0
Niedersachsen       7.9
Rheinland-Pfalz     4.0
Saarland            NaN
Sachsen             4.0
Name: Einwohner, dtype: float64

In [101]:
type(d2["Einwohner"])

pandas.core.series.Series

Wie aber greifen wir auf eine Zeile zu, z.B. auf die Zeile "Niedersachsen"?

Hierzu gibt es zwei Möglichkeiten. Zugriff mittels:

- einem Indexnamen => loc
- einer Zeilenposition => iloc

In [102]:
d2.loc["Niedersachsen"]

Landeshauptstadt    Hannover
Einwohner                7.9
Name: Niedersachsen, dtype: object

In [103]:
type(d2.loc["Niedersachsen"])

pandas.core.series.Series

In [104]:
d2.loc["Niedersachsen"].name

'Niedersachsen'

In [105]:
d2.iloc[1]

Landeshauptstadt    Hannover
Einwohner                7.9
Name: Niedersachsen, dtype: object

Mehrere Zeilen auf einmal auswählen:

In [106]:
d2.loc[ ["Niedersachsen", "Bayern"] ]

              Landeshauptstadt  Einwohner
Niedersachsen         Hannover        7.9
Bayern                    -123       13.0

In [107]:
type( d2.loc[ ["Niedersachsen", "Bayern"] ] )

pandas.core.frame.DataFrame

In [108]:
d2.iloc [ [0,1] ]

              Landeshauptstadt  Einwohner
Bayern                    -123       13.0
Niedersachsen         Hannover        7.9

In [109]:
d2.iloc [ 0:2 ]

              Landeshauptstadt  Einwohner
Bayern                    -123       13.0
Niedersachsen         Hannover        7.9

Von mehreren Zeilen nur einige ausgewählte Spalten selektieren:

In [110]:
d2.loc[ ["Bayern", "Niedersachsen"], ["Landeshauptstadt"] ]

              Landeshauptstadt
Bayern                    -123
Niedersachsen         Hannover

In [111]:
d2.iloc[ [0,1], [0] ]

              Landeshauptstadt
Bayern                    -123
Niedersachsen         Hannover

## Löschen von Spalten und Zeilen

Fangen wir mal mit dem Löschen von Zeilen an:

In [112]:
d2

                Landeshauptstadt  Einwohner
Bayern                      -123       13.0
Niedersachsen           Hannover        7.9
Rheinland-Pfalz            Mainz        4.0
Saarland             Saarbrücken        NaN
Sachsen                  Dresden        4.0

Wir löschen jetzt eine Zeile, die wir über ihren Namen referenzieren:

In [113]:
d2.drop( "Bayern" )

                Landeshauptstadt  Einwohner
Niedersachsen           Hannover        7.9
Rheinland-Pfalz            Mainz        4.0
Saarland             Saarbrücken        NaN
Sachsen                  Dresden        4.0

Jetzt löschen wir die Zeilen über Angabe der Zeilennummer:

In [114]:
print( d2.index[2] )
d2.drop( d2.index[2] )

Rheinland-Pfalz

              Landeshauptstadt  Einwohner
Bayern                    -123       13.0
Niedersachsen         Hannover        7.9
Saarland           Saarbrücken        NaN
Sachsen                Dresden        4.0

Wir können aber auch mittels `drop()` Spalten in einem DataFrame löschen.

Zuerst löschen wir jetzt eine Spalte über Angabe des Spaltennamens:

In [115]:
d2.drop( "Landeshauptstadt", axis=1 )

                 Einwohner
Bayern                13.0
Niedersachsen          7.9
Rheinland-Pfalz        4.0
Saarland               NaN
Sachsen                4.0

Jetzt löschen wir eine Spalte über Angabe der Spaltennummer:

In [116]:
d2.drop( d2.columns[0], axis=1 )

                 Einwohner
Bayern                13.0
Niedersachsen          7.9
Rheinland-Pfalz        4.0
Saarland               NaN
Sachsen                4.0

## Hinzufügen von Spalten

Eine Spalte hinzufügen (als letzte Spalte):

In [117]:
d6 = d2.copy()

In [118]:
schulden_in_mrd_euro = [17.8, 58.9, 32.1, 14.0, 7.7]
schulden_pro_kopf_in_euro = [1372, 7400, 7900, 14144, 1913]

d6["Schulden in MRD Euro"] = schulden_in_mrd_euro

In [119]:
d6

                Landeshauptstadt  Einwohner  Schulden in MRD Euro
Bayern                      -123       13.0                  17.8
Niedersachsen           Hannover        7.9                  58.9
Rheinland-Pfalz            Mainz        4.0                  32.1
Saarland             Saarbrücken        NaN                  14.0
Sachsen                  Dresden        4.0                   7.7

Achtung! Die Spaltennamen sind "case-sensitive"!

In [122]:
# folgende Zeile gibt einen "key error",
# da das "e" von Euro klein geschrieben ist
#d6["Schulden in MRD euro"]

Jetzt fügen wir eine Spalte an einer bestimmten Position ein:

In [123]:
d6.insert(0, "Schulden pro Kopf in Euro", schulden_pro_kopf_in_euro)

In [124]:
d6

,Schulden pro Kopf in Euro,Landeshauptstadt,Einwohner,Schulden in MRD Euro
Bayern,1372,-123,13.0,17.8
Niedersachsen,7400,Hannover,7.9,58.9
Rheinland-Pfalz,7900,Mainz,4.0,32.1
Saarland,14144,Saarbrücken,NaN,14.0
Sachsen,1913,Dresden,4.0,7.7

Jetzt löschen wir diese Spalte wieder (auf eine neue Art):

In [125]:
del d6["Schulden pro Kopf in Euro"]

In [126]:
d6

                Landeshauptstadt  Einwohner  Schulden in MRD Euro
Bayern                      -123       13.0                  17.8
Niedersachsen           Hannover        7.9                  58.9
Rheinland-Pfalz            Mainz        4.0                  32.1
Saarland             Saarbrücken        NaN                  14.0
Sachsen                  Dresden        4.0                   7.7

Was passiert eigentlich, wenn wir eine Spalte zweimal hinzufügen?

In [127]:
d6["Schulden pro Kopf in Euro"] = schulden_pro_kopf_in_euro

In [128]:
d6["Schulden pro Kopf in Euro"] = schulden_pro_kopf_in_euro

In [129]:
d6

,Landeshauptstadt,Einwohner,Schulden in MRD Euro,Schulden pro Kopf in Euro
Bayern,-123,13.0,17.8,1372
Niedersachsen,Hannover,7.9,58.9,7400
Rheinland-Pfalz,Mainz,4.0,32.1,7900
Saarland,Saarbrücken,NaN,14.0,14144
Sachsen,Dresden,4.0,7.7,1913

Wir sehen: die Spalte gibt es trotzdem nur einmal. Es dürfen aber prinzipiell Spalten mehrfach hinzugefügt werden, d.h. mit gleichem Spaltennamen (=Name der Series):

In [130]:
d6.insert(0, "Schulden pro Kopf in Euro", schulden_pro_kopf_in_euro, True)

In [131]:
d6

,Schulden pro Kopf in Euro,Landeshauptstadt,Einwohner,Schulden in MRD Euro,Schulden pro Kopf in Euro
Bayern,1372,-123,13.0,17.8,1372
Niedersachsen,7400,Hannover,7.9,58.9,7400
Rheinland-Pfalz,7900,Mainz,4.0,32.1,7900
Saarland,14144,Saarbrücken,NaN,14.0,14144
Sachsen,1913,Dresden,4.0,7.7,1913

Quizfrage: 
Was bekommen wir dann aber zurück, wenn wir auf die Spalte zugreifen wollen?

In [132]:
d6["Schulden pro Kopf in Euro"]

                 Schulden pro Kopf in Euro  Schulden pro Kopf in Euro
Bayern                                1372                       1372
Niedersachsen                         7400                       7400
Rheinland-Pfalz                       7900                       7900
Saarland                             14144                      14144
Sachsen                               1913                       1913

In [133]:
print(type(d6["Schulden pro Kopf in Euro"]))

<class 'pandas.core.frame.DataFrame'>

Was bekommen wir nun, wenn wir auf eine Zeile zugreifen und uns von der Zeile dann die Spalte holen wollen, die es laut Namen doppelt gibt?

In [134]:
d6.loc["Bayern"]["Schulden pro Kopf in Euro"]

Schulden pro Kopf in Euro    1372
Schulden pro Kopf in Euro    1372
Name: Bayern, dtype: object

Wir erhalten also eine Series und nicht einen einzelnen Wert (wie sonst, wenn es die Spalte nur einmal gibt):

In [135]:
d6.loc["Bayern"]["Landeshauptstadt"]

-123

## Zwei Variablen, die ein DataFrame referenzieren

Was passiert eigentlich, wenn wir über zwei Variablen (hier: d1,d7) ein DataFrame referenzieren und über eine Variable abändern (hier: d7)?

Erhalten wir dann auch über die andere Variable das abgeänderte DataFrame? (hier: d1)

Antwort: Ja!

Begründung: Beide Variablen referenzieren nur ein Python Objekt. Sie sind nur Referenzen und enthalten nicht selber das Objekt.

In [137]:
d1

                 Einwohner Landeshauptstadt
Bayern                13.0             -123
Niedersachsen          7.9         Hannover
Rheinland-Pfalz        4.0            Mainz
Saarland               NaN      Saarbrücken
Sachsen                4.0          Dresden

In [138]:
d7 = d1

In [139]:
d7

                 Einwohner Landeshauptstadt
Bayern                13.0             -123
Niedersachsen          7.9         Hannover
Rheinland-Pfalz        4.0            Mainz
Saarland               NaN      Saarbrücken
Sachsen                4.0          Dresden

In [143]:
d7.insert(0, "Schulden pro Kopf in Euro", schulden_pro_kopf_in_euro)

In [144]:
d7

                 Schulden pro Kopf in Euro  Einwohner Landeshauptstadt
Bayern                                1372       13.0             -123
Niedersachsen                         7400        7.9         Hannover
Rheinland-Pfalz                       7900        4.0            Mainz
Saarland                             14144        NaN      Saarbrücken
Sachsen                               1913        4.0          Dresden

In [145]:
d1

                 Schulden pro Kopf in Euro  Einwohner Landeshauptstadt
Bayern                                1372       13.0             -123
Niedersachsen                         7400        7.9         Hannover
Rheinland-Pfalz                       7900        4.0            Mainz
Saarland                             14144        NaN      Saarbrücken
Sachsen                               1913        4.0          Dresden

## Hinzufügen von Zeilen

In [161]:
d7

                 Schulden pro Kopf in Euro  Einwohner Landeshauptstadt
Bayern                                1372       13.0             -123
Niedersachsen                         7400        7.9         Hannover
Rheinland-Pfalz                       7900        4.0            Mainz
Saarland                             14144        NaN      Saarbrücken
Sachsen                               1913        4.0          Dresden

In [162]:
neue_zeile = {"Schulden pro Kopf in Euro": 0, "Einwohner": 0.8,
              "Landeshauptstadt": "Palma de Mallorca"}

In [163]:
neue_zeile

{'Einwohner': 0.8,
 'Landeshauptstadt': 'Palma de Mallorca',
 'Schulden pro Kopf in Euro': 0}

In [164]:
s = pd.Series(neue_zeile)

In [165]:
s

Einwohner                                  0.8
Landeshauptstadt             Palma de Mallorca
Schulden pro Kopf in Euro                    0
dtype: object

In [166]:
s.name = "Mallorca"

In [167]:
s

Einwohner                                  0.8
Landeshauptstadt             Palma de Mallorca
Schulden pro Kopf in Euro                    0
Name: Mallorca, dtype: object

In [168]:
d7.append( s )

                 Schulden pro Kopf in Euro  Einwohner   Landeshauptstadt
Bayern                                1372       13.0               -123
Niedersachsen                         7400        7.9           Hannover
Rheinland-Pfalz                       7900        4.0              Mainz
Saarland                             14144        NaN        Saarbrücken
Sachsen                               1913        4.0            Dresden
Mallorca                                 0        0.8  Palma de Mallorca